<html><head><title>PUBLICIDADE DE DADOS GOVERNAMENTAIS.</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" >
<link rel="stylesheet" type="text/css" title="pod_stylesheet" href="http://st.pimg.net/tucs/style.css">

</head>
<body class='pod'>
<a name='___top' class='dummyTopAnchor' ></a>

<div class='indexgroup'>
<ul   class='indexList indexList1'>
  <li class='indexItem indexItem1'><a href='#PUBLICIDADE_DE_DADOS_GOVERNAMENTAIS.'>PUBLICIDADE DE DADOS GOVERNAMENTAIS.</a>
  <li class='indexItem indexItem1'><a href='#ABSTRA%C7%C3O'>ABSTRA&#199;&#195;O</a>
  <ul   class='indexList indexList2'>
    <li class='indexItem indexItem2'><a href='#OS_3_PONTOS_FUNDAMENTAIS'>OS 3 PONTOS FUNDAMENTAIS</a>
    <li class='indexItem indexItem2'><a href='#BRASIL%2C_A_LEI'>BRASIL, A LEI</a>
    <li class='indexItem indexItem2'><a href='#PROPOSTA_T%C9CNICA'>PROPOSTA T&#201;CNICA</a>
    <li class='indexItem indexItem2'><a href='#OPENDATA'>OPENDATA</a>
    <ul   class='indexList indexList3'>
      <li class='indexItem indexItem3'><a href='#Princ%EDpios'>Princ&#237;pios</a>
      <li class='indexItem indexItem3'><a href='#ACESSO_LIVRE'>ACESSO LIVRE</a>
      <li class='indexItem indexItem3'><a href='#SEPARAR_OS_DADOS_AO_M%C1XIMO'>SEPARAR OS DADOS AO M&#193;XIMO</a>
      <li class='indexItem indexItem3'><a href='#RESPONSABILIDADE'>RESPONSABILIDADE</a>
      <li class='indexItem indexItem3'><a href='#R%C1PIDA_INTEGRA%C7%C3O'>R&#193;PIDA INTEGRA&#199;&#195;O</a>
      <li class='indexItem indexItem3'><a href='#COMPARTILHAMENTO_DE_BOAS_PR%C1TICAS'>COMPARTILHAMENTO DE BOAS PR&#193;TICAS</a>
      <li class='indexItem indexItem3'><a href='#FORMATOS_DE_ARQUIVOS'>FORMATOS DE ARQUIVOS</a>
      <li class='indexItem indexItem3'><a href='#SERIALIZA%C7%C3O_DE_DADOS'>SERIALIZA&#199;&#195;O DE DADOS</a>
      <ul   class='indexList indexList4'>
        <li class='indexItem indexItem4'><a href='#CSV'>CSV</a>
        <li class='indexItem indexItem4'><a href='#RDF'>RDF</a>
      </ul>
      <li class='indexItem indexItem3'><a href='#Perguntas'>Perguntas</a>
      <ul   class='indexList indexList4'>
        <li class='indexItem indexItem4'><a href='#De_onde_os_dados_devem_vir_%3F'>De onde os dados devem vir ?</a>
        <li class='indexItem indexItem4'><a href='#Como_ele_deve_ser_alimentado_%3F'>Como ele deve ser alimentado ?</a>
        <li class='indexItem indexItem4'><a href='#Quais_os_formatos_%3F'>Quais os formatos ?</a>
        <li class='indexItem indexItem4'><a href='#Existe_um_padr%E3o_para_os_dados_%3F'>Existe um padr&#227;o para os dados ?</a>
        <li class='indexItem indexItem4'><a href='#Com_qual_frequencia_%3F'>Com qual frequencia ?</a>
        <li class='indexItem indexItem4'><a href='#Como_dividir_os_dados_%3F'>Como dividir os dados ?</a>
        <li class='indexItem indexItem4'><a href='#Data-driven_para_o_jornalismo_%3F'>Data-driven para o jornalismo ?</a>
      </ul>
    </ul>
    <li class='indexItem indexItem2'><a href='#OWL_(Web_Ontology_Language)'>OWL (Web Ontology Language)</a>
    <li class='indexItem indexItem2'><a href='#CONECTANDO_DADOS'>CONECTANDO DADOS</a>
    <ul   class='indexList indexList3'>
      <li class='indexItem indexItem3'><a href='#Datasets'>Datasets</a>
      <ul   class='indexList indexList4'>
        <li class='indexItem indexItem4'><a href='#FOAF'>FOAF</a>
        <li class='indexItem indexItem4'><a href='#GeoNames'>GeoNames</a>
        <li class='indexItem indexItem4'><a href='#DBpedia'>DBpedia</a>
      </ul>
    </ul>
    <li class='indexItem indexItem2'><a href='#REPOSIT%D3RIO_VISUAL'>REPOSIT&#211;RIO VISUAL</a>
  </ul>
  <li class='indexItem indexItem1'><a href='#CONCLUS%C3O'>CONCLUS&#195;O</a>
  <li class='indexItem indexItem1'><a href='#AGRADECIMENTO'>AGRADECIMENTO</a>
  <li class='indexItem indexItem1'><a href='#Refer%EAncias'>Refer&#234;ncias</a>
  <li class='indexItem indexItem1'><a href='#AUTOR'>AUTOR</a>
</ul>
</div>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="PUBLICIDADE_DE_DADOS_GOVERNAMENTAIS."
>PUBLICIDADE DE DADOS GOVERNAMENTAIS.</a></h1>

<center>
<img src="../../images/opendata-datasets.png">
</center>


<h1><a class='u' href='#___top' title='click to go to top of document'
name="ABSTRA&#199;&#195;O"
>ABSTRA&#199;&#195;O</a></h1>

<p>A Internet &#233; uma jun&#231;&#227;o de pessoas e computadores em escala mundial,
no qual h&#225; uma facilidade e grande utiliza&#231;&#227;o de documentos atrav&#233;s da Word Wide Web,
conhecido como WWW,
que &#233; um sistema de hiperm&#237;dia que interligam documentos.</p>

<p>Transpar&#234;ncia na web n&#227;o significa apenas colocar documentos na web,
&#233; preciso que as informa&#231;&#245;es estejam dispon&#237;veis para que humanos e m&#225;quinas consigam interpretar elas de forma &#225;gil.
Oferecendo transpar&#234;ncia via Internet,
podemos esperar colabora&#231;&#227;o e participa&#231;&#227;o para que exista uma inova&#231;&#227;o na cria&#231;&#227;o de aplicativos,
como por exemplo para criar novas visualiza&#231;&#245;es dos dados ou mash-ups.</p>

<p>Estas tecnologias podem prover para o governo uma maneira inovadora de expor os dados j&#225; p&#250;blicos,
de forma que muitos consigam usar de fato.
Sabemos que h&#225; fatores como pol&#237;tica,
legais e de cultura,
por&#233;m com um esfor&#231;o para esta implementa&#231;&#227;o o retorno ser&#225; positivo.</p>

<p>Jornalistas,
analistas pol&#237;ticos,
desenvolvedores de software,
organiza&#231;&#245;es,
empres&#225;rios,
advogados,
m&#233;dicos e o p&#250;blico em geral ir&#227;o ter recursos para acessar e entender todo o reposit&#243;rio de dados gerado pelo governo.</p>

<p>A constitui&#231;&#227;o brasileira prev&#234; a publicidade de uma grande quantidade de informa&#231;&#245;es de interesse da sociedade que atualmente n&#227;o explora todo potencial de documentos na Web.</p>

<p>A principal proposta deste documento &#233; apontar os melhores caminhos para serem seguidos para facilitar a publicidade dos dados,
assim como a explora&#231;&#227;o deles para a sociedade.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="OS_3_PONTOS_FUNDAMENTAIS"
>OS 3 PONTOS FUNDAMENTAIS</a></h2>

<p>O entendimento dos pontos fundamentais deste documento oferece uma abordagem de que com a boa utiliza&#231;&#227;o da tecnologia existente e iniciativa da sociedade podemos potencializar cada um deles cada vez mais.</p>

<ul>
<li>Transpar&#234;ncia,
prover acesso aos dados.</li>

<li>Participa&#231;&#227;o,
facilitar a educa&#231;&#227;o p&#250;blica,
participa&#231;&#227;o e inova&#231;&#227;o.</li>

<li>Colabora&#231;&#227;o,
feedback e outreach.</li>
</ul>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="BRASIL,_A_LEI"
>BRASIL,
A LEI</a></h2>

<p>A constitui&#231;&#227;o brasileira:</p>

<pre>     Art. 37. A administra&#231;&#227;o p&#250;blica direta e indireta de qualquer dos
     Poderes da Uni&#227;o, dos Estados, do Distrito Federal e dos Munic&#237;pios
     obedecer&#225; aos princ&#237;pios de legalidade, impessoalidade, moralidade,
     publicidade e efici&#234;ncia e, tamb&#233;m, ao seguinte: (Reda&#231;&#227;o dada pela
     Emenda Constitucional n&#186; 19, de 1998)

     (...)

     XXII - as administra&#231;&#245;es tribut&#225;rias da Uni&#227;o, dos Estados, do
     Distrito Federal e dos Munic&#237;pios, atividades essenciais ao
     funcionamento do Estado, exercidas por servidores de carreiras
     espec&#237;ficas, ter&#227;o recursos priorit&#225;rios para a realiza&#231;&#227;o de suas
     atividades e atuar&#227;o de forma integrada, inclusive com o
     compartilhamento de cadastros e de informa&#231;&#245;es fiscais, na forma da
     lei ou conv&#234;nio. (Inclu&#237;do pela Emenda Constitucional n&#186; 42, de
     19.12.2003)

     &#167; 1&#186; - A publicidade dos atos, programas, obras, servi&#231;os e
     campanhas dos &#243;rg&#227;os p&#250;blicos dever&#225; ter car&#225;ter educativo,
     informativo ou de orienta&#231;&#227;o social, dela n&#227;o podendo constar nomes,
     s&#237;mbolos ou imagens que caracterizem promo&#231;&#227;o pessoal de autoridades
     ou servidores p&#250;blicos.

     &#167; 2&#186; - A n&#227;o observ&#226;ncia do disposto nos incisos II e III implicar&#225;
     a nulidade do ato e a puni&#231;&#227;o da autoridade respons&#225;vel, nos termos
     da lei.

     &#167; 3&#186; - As reclama&#231;&#245;es relativas &#224; presta&#231;&#227;o de servi&#231;os p&#250;blicos
     ser&#227;o disciplinadas em lei.

     &#167; 3&#186; A lei disciplinar&#225; as formas de participa&#231;&#227;o do usu&#225;rio na
     administra&#231;&#227;o p&#250;blica direta e indireta, regulando especialmente:
     (Reda&#231;&#227;o dada pela Emenda Constitucional n&#186; 19, de 1998)

     I - as reclama&#231;&#245;es relativas &#224; presta&#231;&#227;o dos servi&#231;os p&#250;blicos em
     geral, asseguradas a manuten&#231;&#227;o de servi&#231;os de atendimento ao
     usu&#225;rio e a avalia&#231;&#227;o peri&#243;dica, externa e interna, da qualidade dos
     servi&#231;os; (Inclu&#237;do pela Emenda Constitucional n&#186; 19, de 1998)

     II - o acesso dos usu&#225;rios a registros administrativos e a
     informa&#231;&#245;es sobre atos de governo, observado o disposto no art. 5&#186;,
     X e XXXIII; (Inclu&#237;do pela Emenda Constitucional n&#186; 19, de 1998)

     III - a disciplina da representa&#231;&#227;o contra o exerc&#237;cio negligente ou
     abusivo de cargo, emprego ou fun&#231;&#227;o na administra&#231;&#227;o p&#250;blica.
     (Inclu&#237;do pela Emenda Constitucional n&#186; 19, de 1998)

     &#167; 4&#186; - Os atos de improbidade administrativa importar&#227;o a suspens&#227;o
     dos direitos pol&#237;ticos, a perda da fun&#231;&#227;o p&#250;blica, a
     indisponibilidade dos bens e o ressarcimento ao er&#225;rio, na forma e
     grada&#231;&#227;o previstas em lei, sem preju&#237;zo da a&#231;&#227;o penal cab&#237;vel.

     &#167; 5&#186; - A lei estabelecer&#225; os prazos de prescri&#231;&#227;o para il&#237;citos
     praticados por qualquer agente, servidor ou n&#227;o, que causem
     preju&#237;zos ao er&#225;rio, ressalvadas as respectivas a&#231;&#245;es de
     ressarcimento.

     &#167; 6&#186; - As pessoas jur&#237;dicas de direito p&#250;blico e as de direito
     privado prestadoras de servi&#231;os p&#250;blicos responder&#227;o pelos danos que
     seus agentes, nessa qualidade, causarem a terceiros, assegurado o
     direito de regresso contra o respons&#225;vel nos casos de dolo ou culpa.

     &#167; 7&#186; A lei dispor&#225; sobre os requisitos e as restri&#231;&#245;es ao ocupante
     de cargo ou emprego da administra&#231;&#227;o direta e indireta que
     possibilite o acesso a informa&#231;&#245;es privilegiadas. (Inclu&#237;do pela
     Emenda Constitucional n&#186; 19, de 1998)

     &#167; 8&#186; A autonomia gerencial, or&#231;ament&#225;ria e financeira dos &#243;rg&#227;os e
     entidades da administra&#231;&#227;o direta e indireta poder&#225; ser ampliada
     mediante contrato, a ser firmado entre seus administradores e o
     poder p&#250;blico, que tenha por objeto a fixa&#231;&#227;o de metas de desempenho
     para o &#243;rg&#227;o ou entidade, cabendo &#224; lei dispor sobre: (Inclu&#237;do pela
     Emenda Constitucional n&#186; 19, de 1998)

     (...)</pre>

<p>O Portal da Transpar&#234;ncia do governo federal diz:</p>

<pre>     Todo aquele que guarde, administre, gerencie, arrecade ou utilize
     bens e valores p&#250;blicos tem o dever constitucional e moral de
     prestar contas dos recursos p&#250;blicos. Essa presta&#231;&#227;o de contas
     consiste no envio, aos &#243;rg&#227;os respons&#225;veis, do conjunto de
     documentos e informa&#231;&#245;es, obtidos direta ou indiretamente, que
     permitam avaliar a conformidade e o desempenho da gest&#227;o dos
     respons&#225;veis por pol&#237;ticas p&#250;blicas, bens, valores e servi&#231;os
     p&#250;blicos federais.

     A CGU e o Minist&#233;rio do Planejamento, Or&#231;amento e Gest&#227;o
     institu&#237;ram, por meio da Portaria Interministerial n.&#176; 140, de 16 de
     mar&#231;o de 2006, a cria&#231;&#227;o das P&#225;ginas de Transpar&#234;ncia P&#250;blica dos
     &#243;rg&#227;os e entidades da Administra&#231;&#227;o P&#250;blica Federal. S&#227;o site que
     apresentam os dados relativos a execu&#231;&#227;o or&#231;ament&#225;ria, licita&#231;&#245;es
     p&#250;blicas, contrata&#231;&#245;es, conv&#234;nios e di&#225;rias e passagens da
     Presid&#234;ncia da Rep&#250;blica, dos minist&#233;rios e dos outros &#243;rg&#227;os e
     entidades do Governo Federal.

     A CGU tamb&#233;m desenvolve o Programa Olho Vivo no Dinheiro P&#250;blico, a
     fim de capacitar agentes p&#250;blicos municipais em assuntos pertinentes
     &#224; transpar&#234;ncia da gest&#227;o, &#224; responsabiliza&#231;&#227;o e &#224; necessidade do
     cumprimento dos dispositivos legais.

     A Controladoria ainda oferece regularmente o curso a dist&#226;ncia
     &#34;Controle Social e Cidadania&#34;. Os objetivos da capacita&#231;&#227;o, voltada
     para conselheiros e agentes p&#250;blicos municipais, lideran&#231;as locais,
     professores, estudantes e cidad&#227;os em geral, s&#227;o incentivar a
     atua&#231;&#227;o no controle social das a&#231;&#245;es de governo e promover a melhor
     aplica&#231;&#227;o dos recursos p&#250;blicos. O curso est&#225; estruturado em tr&#234;s
     m&#243;dulos: &#34;A participa&#231;&#227;o popular no Estado brasileiro&#34;; &#34;O controle
     das a&#231;&#245;es governamentais&#34;; e &#34;O encaminhamento de den&#250;ncias aos
     &#243;rg&#227;os respons&#225;veis&#34;.</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="PROPOSTA_T&#201;CNICA"
>PROPOSTA T&#201;CNICA</a></h2>

<p>Apenas liberar os documentos n&#227;o torna o processo t&#227;o eficaz em rela&#231;&#227;o a publicidade dos dados, pois a dificuldade em manipular a quantidade de documentos gerados pelo governo pode tornar a tarefa dif&#237;cil.</p>

<p>A miss&#227;o deste documento &#233; incentivar o governo a adotar padr&#245;es abertos de arquivos de dados para que haja uma facilidade maior para manipular estas informa&#231;&#245;es pela sociedade, pois o que buscamos tecnicamente &#233;:</p>

<ul>
<li>Participa&#231;&#227;o atrav&#233;s de documentos em um formato de f&#225;cil manipula&#231;&#227;o por humanos.</li>

<li>Participa&#231;&#227;o atrav&#233;s de documentos em um formato de manipula&#231;&#227;o inteligente por m&#225;quinas.</li>
</ul>

<p>Para que isto ocorra, precisamos primeiramente definir o que s&#227;o dados abertos.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="OPENDATA"
>OPENDATA</a></h2>

<p>O conceito opendata n&#227;o &#233; novidade, por&#233;m esta sempre sendo utilizado em v&#225;rios cen&#225;rios distintos, pois o opendata &#233; uma filosofia e pratica que requer que um determinado dado esteja dispon&#237;vel para todos sem nenhum tipo de restri&#231;&#227;o.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="Princ&#237;pios"
>Princ&#237;pios</a></h3>

<p>Para que um dado seja considerado opendata, ele deve seguir alguns principios basicos, como:</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="ACESSO_LIVRE"
>ACESSO LIVRE</a></h3>

<p>Qualquer pessoa na rede dever&#225; ter acesso aos documentos sem discrimina&#231;&#227;o de grupos ou pessoa. Algumas tecnologias podem excluir, como por exemplo a utiliza&#231;&#227;o de um sistema de captcha baseado apenas em imagem, no qual deficientes visuais quando tentarem acessarem seriam impedidos de buscar os dados.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="SEPARAR_OS_DADOS_AO_M&#193;XIMO"
>SEPARAR OS DADOS AO M&#193;XIMO</a></h3>

<p>Facilitar a utiliza&#231;&#227;o dos dados, tamb&#233;m &#233; fazer com que eles estejam ao m&#225;ximo separados em arquivos distintos para facilitar o entendimento e analise da informa&#231;&#227;o, ou seja as informa&#231;&#245;es devem estar armazenadas em um arquivo da maior unidade possivel para an&#225;lise, al&#233;m de evitar resumos.</p>

<p>Aplicar a mistura de informa&#231;&#245;es distintas pode ser uma op&#231;&#227;o interessante em um segundo plano, e para facilitar o entendimento de um determinado dado em um contexto diferente.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="RESPONSABILIDADE"
>RESPONSABILIDADE</a></h3>

<p>Promover a responsabiliade dentro dos v&#225;rios departamentos do governo para que eles possam publicar estes dados com qualidade e da maneira mais r&#225;pida possivel, de forma segura para o governo e a sociedade.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="R&#193;PIDA_INTEGRA&#199;&#195;O"
>R&#193;PIDA INTEGRA&#199;&#195;O</a></h3>

<p>Oferecer ferramentas e especifica&#231;&#245;es t&#233;cnicas para que estas integra&#231;&#245;es sejam realizadas de forma r&#225;pida e constante.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="COMPARTILHAMENTO_DE_BOAS_PR&#193;TICAS"
>COMPARTILHAMENTO DE BOAS PR&#193;TICAS</a></h3>

<p>Para que exista uma r&#225;pida integra&#231;&#227;o, &#233; necess&#225;rio compartilhar informa&#231;&#245;es e experi&#234;ncias relacionadas a boas pr&#225;ticas entre os org&#227;os.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="FORMATOS_DE_ARQUIVOS"
>FORMATOS DE ARQUIVOS</a></h3>

<p>Formatos de arquivos pr&#243;priet&#225;rios podem criar dependencia tecnologica para o uso das informa&#231;&#245;es, e isto pode criar restri&#231;&#227;o de acesso aos dados.</p>

<p>Eles devem estar estruturados e organizados para que se tenha maior facilidade de softwares manipularem eles. Por exemplo, alguns documentos s&#227;o oferecidos pelo governo em formato PDF, no qual s&#227;o imagens e n&#227;o h&#225; nenhuma estrutura do documento para ser visualizada por um software.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="SERIALIZA&#199;&#195;O_DE_DADOS"
>SERIALIZA&#199;&#195;O DE DADOS</a></h3>

<p>N&#227;o disponibilizar apenas em um formato aberto os arquivos, pois isto tamb&#233;m poderia prejudicar a utiliza&#231;&#227;o de um grupo de pessoas por falta de conhecimento, e em outros casos faltariam estrutura&#231;&#227;o para manipular os arquivos.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="CSV"
>CSV</a></h4>

<p>N&#227;o h&#225; uma especifica&#231;&#227;o formal deste padr&#227;o, por&#233;m o formato de arquivo CSV armazena dados tabelados em um arquivo de texto separados por um delimitador em comum para separar os valores, e pode ser utilizado aspas em campos no qual s&#227;o usados os caracteres reservados (delimitador comum e quebra de linha).</p>

<p>A utiliza&#231;&#227;o dos arquivos &#34;.csv&#34; &#233; muito simples e suportado por quase todos os editores de texto, planilhas eletr&#244;nicas e SGDB dispon&#237;veis.</p>

<p>Para distribui&#231;&#227;o dos dados governamentais a sugest&#227;o &#233; que seja utilizada na primeira linha, o cabe&#231;alho, o nome das colunas dos dados que estar&#227;o dispostos no arquivo, um exemplo:</p>

<pre>    EMPRESA,CNPJ,TELEFONE,ENDERECO,CEP
    Empresa de exemplo, 0000-0000-0000/0000-1, 1234-1234, Rua exemplo, 42420-123
    Empresa de exemplo 2, 0000-0000-0000/0000-2, 1234-1234, Rua exemplo, 42420-123</pre>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="RDF"
>RDF</a></h4>

<p>A linguagem para representa&#231;&#227;o de informa&#231;&#245;es na Internet, no qual s&#227;o arquivos baseados em metadata com objetivo de criar um modelo de documento com uma sem&#226;ntica se utilizando de sintaxe XML.</p>

<p>Com os dados estruturados, a utiliza&#231;&#227;o de linguagens para consulta pode auxiliar muito quem quer pesquisar ou apontar para os dados para documentos que estejam na Internet. Uma destas linguagems &#233; a SPARQL.</p>

<p>Em alguns casos h&#225; uma dificuldade t&#233;cnica de implementa&#231;&#227;o, pois os dados j&#225; est&#227;o formatos em um determinado padr&#227;o, ou em um banco de dados que n&#227;o tem um modo trivial para serializar estes dados, por&#233;m existe j&#225; uma diversidade de tecnologias dispon&#237;veis na pr&#243;pria rede para facilitar este trabalho. Um exemplo muito bom de trabalho realizado neste sentido &#233; o projeto DR2 Server, no qual ele trabalha como uma camada na frente de um banco de dados relacional que oferece os dados em RDF e a capacidade de oferecer consultas em SPARQL.</p>

<p>A ideia de ter os arquivos usados em RDF, &#233; principalmente usufruir do conceito principal do design deste framework, que ele &#233; baseado em URI e XML. Isto significa que a utiliza&#231;&#227;o dos documentos nestes conceitos podem oferecer uma utiliza&#231;&#227;o muito trivial por muitas pessoas e com uma organiza&#231;&#227;o de dados unificada.</p>

<p>Encontre mais informa&#231;&#245;es para publica&#231;&#227;o de arquivos RDF no final deste documento, em refer&#234;ncias.</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="Perguntas"
>Perguntas</a></h3>

<dl>
<dt><a name="1._De_onde_os_dados_devem_vir_?"
>1. De onde os dados devem vir ?
<dt><a name="2._Como_ele_deve_ser_alimentado_?"
>2. Como ele deve ser alimentado ?
<dt><a name="3._Quais_os_formatos_?"
>3. Quais os formatos ?
<dt><a name="4._Existe_um_padr&#227;o_para_os_dados_?"
>4. Existe um padr&#227;o para os dados ?
<dt><a name="5._Com_qual_frequencia_?"
>5. Com qual frequencia ?
<dt><a name="6._Como_dividir_os_dados_?"
>6. Como dividir os dados ?
<dt><a name="7._Data-driven_para_o_jornalismo_?"
>7. Data-driven para o jornalismo ?</a></dt>
</dl>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="De_onde_os_dados_devem_vir_?"
>De onde os dados devem vir ?</a></h4>

<p>Quando o assunto &#233; governo, os dados devem ser os que s&#227;o j&#225; estabelecidos por lei como no caso do Brasil que garante a publicidade de uma enorme quantidade de dados.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Como_ele_deve_ser_alimentado_?"
>Como ele deve ser alimentado ?</a></h4>

<p>Estes dados al&#233;m de alimentar banco de dados internos que s&#243; o governo pode visualizar eles, &#233; interessante que ele seja alimenato hoje em formatos abertos na Internet, para que exista uma reutiliza&#231;&#227;o destas informa&#231;&#245;es de maneira mais trivial pela sociedade.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Quais_os_formatos_?"
>Quais os formatos ?</a></h4>

<p>Assim como os dados, os formatos devem ser abertos para que n&#227;o exista dependencia tecnologica para o acesso aos dados. Existe sempre uma alternativa ao formato propriet&#225;rio.</p>

<p>Um exemplo muito comum de uso do formato propriet&#225;rio, e oferecer os dados em formatos de planilhas excel, no qual uma das alternativas em formato livre seria o CSV.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Existe_um_padr&#227;o_para_os_dados_?"
>Existe um padr&#227;o para os dados ?</a></h4>

<p>Na Internet, existem padr&#245;es &#243;timas como por exemplo o RDF que define um padr&#227;o baseado em URI que define a localiza&#231;&#227;o dos arquivos na rede, e em XML que define como o documento ser&#225; disposto.</p>

<p>Al&#233;m de oferecer os arquivos em RDF &#233; interessante que seja oferecido em formatos que sejam de f&#225;cil manipula&#231;&#227;o por humanos, como por exemplo o CSV.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Com_qual_frequencia_?"
>Com qual frequencia ?</a></h4>

<p>Assim como quais dados devem ser alimentados, o ideal &#233; que sejam oferecidos como a lei estabelece a publicidade dos dados e os prazos para que eles estejam dispostos tamb&#233;m.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Como_dividir_os_dados_?"
>Como dividir os dados ?</a></h4>

<p>A divis&#227;o dos dados &#233; um fator muito importante para re-utiliza&#231;&#227;o deles de uma maneira mais proveitosa, isto significa que dividir as informa&#231;&#245;es no m&#225;ximo de arquivos possiveis &#233; interessante para que a leitura seja mais simples.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="Data-driven_para_o_jornalismo_?"
>Data-driven para o jornalismo ?</a></h4>

<p>O processo do jornalismo &#233; um exemplo interessante do que outros profissionais podem fazer com os dados obtidos em rela&#231;&#227;o ao opendata, que basicamente um dado que passe por um filtro e seja bem visualizado possa criar uma boa noticia.</p>

<p>Para que isto ocorra, boas praticas s&#227;o necess&#225;rias tanto por quem abre os dados como para quem ir&#225; criar uma nova informa&#231;&#227;o, como a not&#237;cia neste caso. Por exemplo, criar uma not&#237;cia e n&#227;o oferecer esta nova vis&#227;o como dado aberto n&#227;o ir&#225; ajudar na reutiliza&#231;&#227;o desta nova vis&#227;o.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="OWL_(Web_Ontology_Language)"
>OWL (Web Ontology Language)</a></h2>

<p>OWL &#233; uma linguagem para definir e instanciar modelos de dados para informa&#231;&#245;es na web, que o objetivo &#233; oferecer uma interpreta&#231;&#227;o para as m&#225;quinas de forma sem&#225;ntica e n&#227;o apenas de sintaxe, ao inv&#233;s de apresent&#225;-las apenas aos humanos.</p>

<p>Tecnicamente &#233; uma linguagem que se baseia em outras duas linguagens, a OIL e a DAML+OIL que hoje &#233; uma recomenda&#231;&#227;o da W3C.</p>

<p>Esta defini&#231;&#227;o e toda abordagem ao redor do OWL pode oferecer uma mecanica para elabora&#231;&#227;o de vocabul&#225;rios para que a web seja mais sem&#225;ntica aos softwares.</p>

<p>Com ela &#233; possivel facilitar a interpreta&#231;&#227;o de dados por m&#225;quinas por linguagens como XML, RDF, RDFS, e etc que iremos ver mais alguns artigos no decorrer deste equin&#243;cio.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="CONECTANDO_DADOS"
>CONECTANDO DADOS</a></h2>

<p>Al&#233;m de oferecer os arquivos para serem visualizados ou para download, a necessidade de que estes dados estejam prontos para serem conectados, ou seja integrados, atrav&#233;s da WEB &#233; essencial para muitos cen&#225;rios.</p>

<p>No documento &#34;Design Issues: Linked Data&#34; de Tim Berners-Lee, ele faz uma explica&#231;&#227;o para que os dados sejam facilmente interligados atrav&#233;s da web eles devem resumidamente :</p>

<ul>
<li>Utilizar URI para identificar &#34;coisas&#34;</li>

<li>Utilizar HTTP URI para que as &#34;coisas&#34; possam ser localizadas por pessoas ou aplicativos</li>

<li>Forneceder informa&#231;&#245;es &#250;teis sobre &#34;coisas&#34;, em formatos como RDF/XML</li>

<li>Incluir links para outros dados como forma de refer&#234;ncia, para melhorar a visualiza&#231;&#227;o dos dados expostos.</li>
</ul>

<p>A serializa&#231;&#227;o destes dados pode ser oferecida em RDFa, RDF/XML, N3, Turtle, ... .</p>

<h3><a class='u' href='#___top' title='click to go to top of document'
name="Datasets"
>Datasets</a></h3>

<p>H&#225; alguns tipos de banco de informa&#231;&#245;es j&#225; definidos para dados como estes, alguns deles s&#227;o:</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="FOAF"
>FOAF</a></h4>

<p>FOAF &#233; um acronimo para Friend of Friend, que &#233; um ontologia para descrever dados de pesssoas, suas atividades, o relacionamento com outras pessoas e objetos, no qual sejam interpretador por m&#225;quinas.</p>

<p>Existe alguns m&#243;dulos para tratar deste tipo de dataset no CPAN, <a href="http://search.cpan.org/perldoc?XML%3A%3AFOAF" class="podlinkpod"
>XML::FOAF</a>, <a href="http://search.cpan.org/perldoc?Gedcom%3A%3AFOAF" class="podlinkpod"
>Gedcom::FOAF</a> e <a href="http://search.cpan.org/perldoc?XML%3A%3AFOAF%3A%3APerson" class="podlinkpod"
>XML::FOAF::Person</a>.</p>

<p>Mais informa&#231;&#245;es sobre esta espefica&#231;&#227;o: http://rdfweb.org/foaf/</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="GeoNames"
>GeoNames</a></h4>

<p>&#201; um tipo de banco de dados que disponibiliza dados geograficos e pode ser acessado por v&#225;rios tipos de &#34;web services&#34;, que &#233; o conjunto de vocabul&#225;rio para adicionar a sem&#225;tica necess&#225;ria nos padr&#245;es abertos para distribui&#231;&#227;o de dados, como RDF/XML, DBpedia e etc.</p>

<p>Existe uma API em Perl para isto, que &#233; <a href="http://search.cpan.org/perldoc?Geo%3A%3AGeoNames" class="podlinkpod"
>Geo::GeoNames</a>, no qual utiliza o webservice http://ws.geonames.org/.</p>

<h4><a class='u' href='#___top' title='click to go to top of document'
name="DBpedia"
>DBpedia</a></h4>

<p>&#201; um projeto que espera extrair informa&#231;&#245;es estruturadas criadas no Wikipedia, no qual permite efetuar consultas e associar documentos entre eles.</p>

<p>Para este projeto ainda n&#227;o h&#225; um m&#243;dulo no CPAN, quem sabe voc&#234; n&#227;o possa escrever o primeiro ?</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="REPOSIT&#211;RIO_VISUAL"
>REPOSIT&#211;RIO VISUAL</a></h2>

<p>A sugest&#227;o &#233; que o reposit&#243;rio visual esteja hospedado dentro do governo, oferecendo um mapa com os recursos dispon&#237;veis dos dados que l&#225; estejam para que as pessoas possam explorar.</p>

<p>Este reposit&#243;rio pode se utilizar da colabora&#231;&#227;o dos demais org&#227;os do governo, no qual eles utilizaram a plataforma do reposit&#243;rio para divulgar os dados j&#225; dispon&#237;veis para compartilhamento, desta maneira os dados abertos (open data) estariam todos em um mesmo local como referencia para a sociedade, porem os dados seriam mantidos dentro de cada org&#227;o, onde os dados s&#227;o gerados.</p>

<p>Desta forma fica mais f&#225;cil para todos, encontrarem os dados e tamb&#233;m posteriormente identificar os locais que estejam com problemas. Dois exemplos &#243;timos s&#227;o o reposit&#243;rio americano (<a href="http://data.gov" class="podlinkurl"
>http://data.gov</a>) e o ingl&#234;s (vide <a href="http://data.gov.uk" class="podlinkurl"
>http://data.gov.uk</a>).</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="CONCLUS&#195;O"
>CONCLUS&#195;O</a></h1>

<p>O governo j&#225; realizou grandes passos, pois existem dispositivos na lei e os dados j&#227;o est&#227;o presentes na WEB, por&#233;m hoje a sociedade enfrenta grandes dificuldades para analisar estes dados.</p>

<p>Acreditamos que com um trabalho mais elaborado e organizado para disponibilizar estes dados todos sair&#227;o ganhando, o governo com sugest&#245;es e particpa&#231;&#227;o mais efetiva da sociedade e a sociedade sabendo mensurar melhor qual o trabalho do governo.</p>

<p>N&#227;o encontrei uma conclus&#227;o ou frase melhor para expressar a motiva&#231;&#227;o por tr&#225;s deste esfor&#231;o para que os dados estejam abertos do que a dita por Eric Raymond em um de seus ensaios do livro Bazar e Cateral, que &#233; a Lei de Linus:</p>

<pre>        &#34;Dados olhos suficientes, todos os erros s&#227;o triviais.&#34;</pre>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="AGRADECIMENTO"
>AGRADECIMENTO</a></h1>

<p>Em especial a Tim Berners-Lee pelo o seu trabalho constante em rela&#231;&#227;o a dados abertos na web.</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="Refer&#234;ncias"
>Refer&#234;ncias</a></h1>

<p>Design Issues: Linked Data por Tim Berners-Lee, <a href="http://www.w3.org/DesignIssues/LinkedData.html" class="podlinkurl"
>http://www.w3.org/DesignIssues/LinkedData.html</a></p>

<p>Publishing Open Government Data por W3, <a href="http://www.w3.org/TR/gov-dataa/" class="podlinkurl"
>http://www.w3.org/TR/gov-dataa/</a></p>

<p>SPARQL Working Group Wiki, <a href="http://www.w3.org/2009/sparql/wiki/Main_Page" class="podlinkurl"
>http://www.w3.org/2009/sparql/wiki/Main_Page</a></p>

<p>Improving Access to Government through Better Use of the Web, <a href="http://www.w3.org/TR/egov-improving/" class="podlinkurl"
>http://www.w3.org/TR/egov-improving/</a></p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="AUTOR"
>AUTOR</a></h1>

<p>Thiago Rondon, thiago.rondon no e-mail gratuito do google.</p>

</body></html>
