<html><head><title>Por que Perl?</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" >
<link rel="stylesheet" type="text/css" title="pod_stylesheet" href="http://st.pimg.net/tucs/style.css">

</head>
<body class='pod'>
<a name='___top' class='dummyTopAnchor' ></a>

<div class='indexgroup'>
<ul   class='indexList indexList1'>
  <li class='indexItem indexItem1'><a href='#Por_que_Perl%3F'>Por que Perl?</a>
  <ul   class='indexList indexList2'>
    <li class='indexItem indexItem2'><a href='#Perl_%E9_uma_linguagem_em_constante_renova%E7%E3o'>Perl &#233; uma linguagem em constante renova&#231;&#227;o</a>
    <li class='indexItem indexItem2'><a href='#Perl_reduz_riscos_de_neg%F3cio'>Perl reduz riscos de neg&#243;cio</a>
    <li class='indexItem indexItem2'><a href='#Perl_se_destaca_no_tratamento_de_informa%E7%F5es'>Perl se destaca no tratamento de informa&#231;&#245;es</a>
    <li class='indexItem indexItem2'><a href='#90%25_do_seu_programa_j%E1_esta_pronto'>90% do seu programa j&#225; esta pronto</a>
    <li class='indexItem indexItem2'><a href='#Baby-Perl_%E9_f%E1cil_de_aprender'>Baby-Perl &#233; f&#225;cil de aprender</a>
    <li class='indexItem indexItem2'><a href='#Comunidade_vibrante_e_pronta_para_ajudar'>Comunidade vibrante e pronta para ajudar</a>
  </ul>
  <li class='indexItem indexItem1'><a href='#Conclus%E3o'>Conclus&#227;o</a>
  <li class='indexItem indexItem1'><a href='#Autor'>Autor</a>
</ul>
</div>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="Por_que_Perl?"
>Por que Perl?</a></h1>

<p>Este n&#227;o &#233; um artigo de &#34;evangeliza&#231;&#227;o&#34;.
N&#227;o vou perder meu tempo - nem o seu - com palavras fan&#225;ticas de um programador apaixonado,
repetidas como um mantra religioso.
Claro,
seria um discuso &#243;timo para novatos,
perdidos na infinidade de op&#231;&#245;es de linguagem de programa&#231;&#227;o,
implorando para que algu&#233;m lhes aponte a bala de prata,
a solu&#231;&#227;o m&#225;gica e definitiva capaz de resolver todos os problemas do planeta.
Mas o mesmo discurso que encanta o iniciante &#233; imediatamente descartado por aqueles que em algum momento foram direcionados a <i>outra</i> bala de prata e nela criaram sua zona de conforto.
Os que insistem - de forma igualmente irracional e fan&#225;tica - na no&#231;&#227;o infantil de que tudo que n&#227;o &#233; seu &#233; feio,
ultrapassado e in&#250;til.</p>

<p>N&#227;o.
A escolha de Perl 5 como linguagem principal (notem: principal,
n&#227;o &#250;nica) para o projeto <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.opendatabr.org" class="podlinkpod"
>OpenData-BR</a> n&#227;o foi movida por fanatismo.
Foi uma escolha consciente.
Quase inevit&#225;vel.
E neste artigo vamos falar um pouco mais sobre os motivos que nos levaram a essa conclus&#227;o.</p>

<p>A primeira coisa que devemos observar &#233; que estamos usando o termo &#34;Perl 5&#34;.
Esse n&#227;o &#233; o Perl de scripts sujos e deselegantes dos anos 1990.
N&#227;o estamos falando de uma linguagem de extens&#227;o para shell-scripts.
Estamos falando de <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.onyxneon.com%2Fbooks%2Fmodern_perl" class="podlinkpod"
>Perl Moderno</a>.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Perl_&#233;_uma_linguagem_em_constante_renova&#231;&#227;o"
>Perl &#233; uma linguagem em constante renova&#231;&#227;o</a></h2>

<p>Perl se orgulha em acompanhar de perto o que est&#225; sendo feito em outras linguagens de programa&#231;&#227;o,
e n&#227;o tem medo de adotar o que funciona e descartar o que n&#227;o d&#225; certo.</p>

<p>Hoje em sua 12a vers&#227;o,
o Perl 5 moderno &#233; uma linguagem de uso geral,
flex&#237;vel e poderosa,
que permite programa&#231;&#227;o orientada a objetos,
funcional,
procedural,
ou orientada a eventos.
Ao adotarmos Perl n&#227;o ficamos presos a um ou outro paradigma,
e colaboradores tem liberdade para escolher a forma que mais se adeque ao problema em quest&#227;o e &#224; sua forma de pensar.</p>

<p>Ao mesmo tempo,
a forte preocupa&#231;&#227;o do Perl com retro-compatibilidade &#233; muito importante,
e permite que projetos como o OpenData utilizem todo esse poder e executem sem problemas em vers&#245;es do perl lan&#231;adas hoje,
a 5 anos atr&#225;s,
ou daqui a 5 anos,
sem qualquer modifica&#231;&#227;o.</p>

<p>Perl roda em <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.perl.org%2Fget.html" class="podlinkpod"
>mais de 100 plataformas diferentes</a>,
de port&#225;teis a mainframes,
e sua <a href="http://search.cpan.org/perldoc?http%3A#%2Fcpantesters.org" class="podlinkpod"
>poderosa infraestrutura de testes</a> para m&#243;dulos d&#225; ao OpenData e seus subprojetos acesso imediato &#224; uma <a href="http://search.cpan.org/perldoc?http%3A#%2Fcpantesters.org%2Fdistro%2FD%2FDataFlow.html" class="podlinkpod"
>detalhada matriz de compatibilidade</a> entre vers&#245;es,
sistemas operacionais e arquiteturas,
para que possamos verificar e garantir a qualidade do c&#243;digo disponibilizado facilmente.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Perl_reduz_riscos_de_neg&#243;cio"
>Perl reduz riscos de neg&#243;cio</a></h2>

<p>Perl &#233; <a href="http://search.cpan.org/perldoc?http%3A#%2Fdev.perl.org%2Flicenses" class="podlinkpod"
>software livre</a>,
e n&#227;o est&#225; amarrado a nenhuma empresa.
A linguagem n&#227;o fica limitada &#224; sa&#250;de financeira de uma empresa ou &#224;s vontades de seus acionistas.
Qualquer um pode <a href="http://search.cpan.org/perldoc?http%3A#%2Fdev.perl.org%2Fperl5%2F" class="podlinkpod"
>verificar o c&#243;digo-fonte</a>,
enviar relat&#243;rios de erro,
escrever corre&#231;&#245;es ou <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FApp%3A%3Aperlbrew" class="podlinkpod"
>compilar sua pr&#243;pria vers&#227;o</a>.</p>

<p>De fato,
Perl possui uma comunidade ativa de <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.cpan.org%2Fauthor%2F" class="podlinkpod"
>mais de 8000 contribuidores</a> em todo o mundo,
mais de 200 destes trabalhando <a href="http://search.cpan.org/perldoc?http%3A#%2Fperl5.git.perl.org%2Fperl.git" class="podlinkpod"
>diretamente no n&#250;cleo da linguagem</a>.
Novas vers&#245;es do Perl s&#227;o <a href="http://search.cpan.org/perldoc?http%3A#%2Fcpan.perl.org%2Fsrc%2FREADME.html" class="podlinkpod"
>lan&#231;adas regularmente</a>,
uma por ano,
com pelo menos dois releases de manuten&#231;&#227;o nesse intervalo,
sem contar os releases mensais da vers&#227;o em desenvolvimento,
que nos permite testar c&#243;digo e identificar problemas em novas vers&#245;es antes mesmo delas terem sido lan&#231;adas.</p>

<p>A estabilidade e robustez do Perl s&#227;o garantidas por anos de maturidade e uma su&#237;te de <a href="http://search.cpan.org/perldoc?http%3A#%2Fqa.perl.org%2Fcpan-testers" class="podlinkpod"
>mais de 92.000 testes para a linguagem</a>,
sem contar os milhares de testes presentes em seus diversos m&#243;dulos auxiliares.
O c&#243;digo interno do Perl foi <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.internetnews.com%2Fdev-news%2Farticle.php%2F3589361" class="podlinkpod"
>certificado</a> como possuidor de uma baix&#237;ssima densidade de defeitos,
e passou na <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.builderau.com.au%2Fnews%2Fsoa%2FPHP-Perl-and-Python-pass-Homeland-Security-test%2F0%2C339028227%2C339284949%2C00.htm" class="podlinkpod"
>valida&#231;&#227;o de seguran&#231;a</a> do <i>Department of Homeland Security</i> dos EUA.
Perl possui ainda o <a href="http://search.cpan.org/perldoc?http%3A#%2Fperldoc.perl.org%2Fperlsec.html%23SECURITY-MECHANISMS-AND-CONCERNS" class="podlinkpod"
>modo &#34;taint&#34;</a>,
que analisa e discrimina entradas externas ao c&#243;digo - de usu&#225;rios,
arquivos ou via Internet - para evitar problemas mais comuns de seguran&#231;a.</p>

<p>Tudo isso fez com que Perl fosse <a href="http://search.cpan.org/perldoc?http%3A#%2Frio.perl.org.br%2Fquem_usa.pl%23empresas" class="podlinkpod"
>adotado</a> para projetos de miss&#227;o cr&#237;tica em todo o mundo,
de sistemas de telecomunica&#231;&#245;es e finan&#231;as a sites na lista dos 100 mais acessados do mundo.</p>

<p>Por ser uma linguagem de alto n&#237;vel,
desenvolvedores perdem menos tempo preocupados com gerenciamento de mem&#243;ria ou tipifica&#231;&#227;o de vari&#225;veis e mais nos objetivos do programa em si.
Desenvolvimento &#225;gil &#233; fundamental para projetos em larga escala como o OpenData,
e Perl provou ser uma &#243;tima op&#231;&#227;o nesse quesito.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Perl_se_destaca_no_tratamento_de_informa&#231;&#245;es"
>Perl se destaca no tratamento de informa&#231;&#245;es</a></h2>

<p>E &#34;tratamento de informa&#231;&#245;es&#34; &#233; o centro do OpenData.
Perl possui suporte nativo a Unicode,
manipula&#231;&#227;o eficiente de strings e o <a href="http://search.cpan.org/perldoc?http%3A#%2Fperldoc.perl.org%2Fperlre.html" class="podlinkpod"
>mais poderoso sistema de express&#245;es regulares da atualidade</a>.</p>

<p>Como veremos ao longo deste equin&#243;cio,
Perl oferece uma s&#233;rie de m&#243;dulos para realizar <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FHTML%3A%3ATreeBuilder" class="podlinkpod"
>parsing eficiente de conte&#250;do HTML</a> e facilmente <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FCatalyst%3A%3AController%3A%3AREST" class="podlinkpod"
>gerar</a> e interagir com web services em <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FJSON%3A%3AAny" class="podlinkpod"
>JSON</a>,
<a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FXML%3A%3ACompile" class="podlinkpod"
>XML</a> ou <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FYAML%3A%3ATiny" class="podlinkpod"
>YAML</a>.
Isso &#233; fundamental para o sucesso de um projeto como o OpenData.
Mesmo formatos mais esot&#233;ricos para disposi&#231;&#227;o de dados p&#250;blicos na Internet conseguem ser tratados com Perl para melhor visualiza&#231;&#227;o pela popula&#231;&#227;o.</p>

<p>Mas coleta e separa&#231;&#227;o de informa&#231;&#245;es p&#250;blicas s&#227;o apenas metade da equa&#231;&#227;o.
Outra vantagem significativa de Perl para este projeto est&#225; na formata&#231;&#227;o das informa&#231;&#245;es coletadas para exibi&#231;&#227;o e interpreta&#231;&#227;o pela popula&#231;&#227;o.
Al&#233;m de ser capaz de converter entre formatos facilmente,
Perl permite a <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.cpan.org%2Fperldoc%3FChart%3A%3AClicker%23Renderers" class="podlinkpod"
>gera&#231;&#227;o de diversos gr&#225;ficos</a> est&#225;ticos e din&#226;micos.</p>

<p>Outro desafio para o OpenData &#233; a comunica&#231;&#227;o entre sistemas e interfaces.
Para isso,
al&#233;m da natural habilidade de convers&#227;o entre formata&#231;&#245;es,
processamento distribuido e interconectividade de rede,
Perl oferece uma <a href="http://search.cpan.org/perldoc?http%3A#%2Fdbi.perl.org" class="podlinkpod"
>interface completa de integra&#231;&#227;o de bancos de dados</a>,
capaz de conectar-se da bancos MySQL,
Oracle,
Sybase,
Postgres,
SQLite e muitos outros sem o menor esfor&#231;o.
Podemos at&#233; mesmo <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FSQL%3A%3ATranslator" class="podlinkpod"
>converter SQL entre diferentes sintaxes</a> espec&#237;ficas de determinados bancos.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="90%_do_seu_programa_j&#225;_esta_pronto"
>90% do seu programa j&#225; esta pronto</a></h2>

<p>Com mais de 22.000 distribui&#231;&#245;es e 90.000 m&#243;dulos,
e uma m&#233;dia acima de <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.cpan.org%2Frecent" class="podlinkpod"
>200 uploads por m&#234;s</a>,
encontramos no <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.cpan.org" class="podlinkpod"
>CPAN</a> todos os componentes necess&#225;rios para reduzir dramaticamente os ciclos de desenvolvimento e nos concentrarmos praticamente apenas na l&#243;gica do software em si,
tornando o desenvolvimento do OpenData e seus subprojetos algo r&#225;pido,
gratificante e prazeroso.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Baby-Perl_&#233;_f&#225;cil_de_aprender"
>Baby-Perl &#233; f&#225;cil de aprender</a></h2>

<p>Dominar qualquer linguagem de programa&#231;&#227;o &#233; algo que requer <a href="http://search.cpan.org/perldoc?http%3A#%2Fnorvig.com%2F21-days.html" class="podlinkpod"
>anos de experi&#234;ncia pr&#225;tica</a>.
Mas em Perl a <a href="http://search.cpan.org/perldoc?http%3A#%2Fsearch.metacpan.org%2F%23%2Fshowpod%2FPOD2%3A%3APT_BR%3A%3Aperlintro" class="podlinkpod"
>barreira de entrada &#233; muito baixa</a>,
e isso &#233; important&#237;ssimo para projetos como o OpenData.</p>

<p>Algu&#233;m que nunca programou antes,
em poucas horas j&#225; consegue escrever programas simples de coleta,
manipula&#231;&#227;o e armazenamento de dados.
Se voc&#234; j&#225; &#233; proficiente em outra linguagem de programa&#231;&#227;o,
esse intervalo cai para apenas alguns minutos,
o suficiente para se familiarizar com a sintaxe.</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Comunidade_vibrante_e_pronta_para_ajudar"
>Comunidade vibrante e pronta para ajudar</a></h2>

<p>Os <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.pm.org%2F" class="podlinkpod"
>&#34;Perl Mongers&#34;</a> possuem comunidades de desenvolvedores e entusiastas espalhadas por todo o planeta e crescendo a cada dia,
com <a href="http://search.cpan.org/perldoc?http%3A#%2Fwww.pm.org%2Fgroups%2Fbrazil.html" class="podlinkpod"
>listas de discuss&#227;o</a> para que novatos possam tirar suas d&#250;vidas e comentar novos projetos,
encontros sociais,
t&#233;cnicos,
participa&#231;&#227;o em <a href="http://search.cpan.org/perldoc?http%3A#%2Ftwitter.com%2F%23!%2Fsppm_workshop" class="podlinkpod"
>redes sociais</a>,
<a href="http://search.cpan.org/perldoc?http%3A#%2Finfo.abril.com.br%2Fforum%2Fviewforum.php%3Ff%3D281" class="podlinkpod"
>f&#243;runs de tecnologia</a>,
<a href="http://search.cpan.org/perldoc?http%3A#%2Fhacknrio.org%2Forganizacao" class="podlinkpod"
>eventos</a> de <a href="http://search.cpan.org/perldoc?http%3A#%2Ffisl.org.br" class="podlinkpod"
>software livre</a> e muitos mais.</p>

<p>Este ano,
por exemplo,
haver&#225; um <a href="http://search.cpan.org/perldoc?http%3A#%2Fperlworkshop.com.br" class="podlinkpod"
>excelente Workshop em S&#227;o Paulo</a> com presen&#231;as internacionais de peso falando sobre solu&#231;&#245;es modernas em Perl,
e o <a href="http://search.cpan.org/perldoc?http%3A#%2Fyapcbrasil.org.br%2F" class="podlinkpod"
>tradicional YAPC no Rio de Janeiro</a>,
uma confer&#234;ncia anual da comunidade Perl para a comunidade Perl,
onde todos s&#227;o convidados para apresentar seus projetos e discutir novas t&#233;cnicas,
m&#243;dulos,
conceitos,
e muito mais.</p>

<p>Voc&#234; est&#225; presenciando parte disso neste exato momento com o <a href="http://search.cpan.org/perldoc?http%3A#%2Fsao-paulo.pm.org%2Fequinocio%2F2011%2F" class="podlinkpod"
>Equin&#243;cio</a>,
que mobilizou volunt&#225;rios de todo o pa&#237;s para a confec&#231;&#227;o de material de qualidade para ampliar seu conhecimento e diminuir ainda mais a barreira de entrada no projeto OpenData.</p>

<p>Esse tipo de apoio da comunidade &#233; fundamental para a longevidade de projetos como o OpenData,
movidos pela pr&#243;pria comunidade.</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="Conclus&#227;o"
>Conclus&#227;o</a></h1>

<p>Programadores experientes provavelmente reconheceram aqui vantagens de suas pr&#243;prias linguagens de programa&#231;&#227;o favoritas.
Python &#233; &#243;tima para aprender a programar,
Ruby possui muitos m&#243;dulos auxiliares,
Java &#233; robusto,
Lua &#233; elegante,
PHP &#233; extremamente popular,
Haskell &#233; flex&#237;vel,
Smalltalk &#233; reflexiva,
entre tantas outras linguagens fant&#225;sticas.</p>

<p>Perl n&#227;o &#233; melhor ou pior que qualquer outra linguagem,
e pode n&#227;o satisfazer as necessidades de seu projeto espec&#237;fico.
Mas,
para o OpenData,
as caracter&#237;sticas acima aliadas &#224; enorme capacidade de integrar solu&#231;&#245;es em diferentes linguagens e interfaces fazem do Perl moderno a escolha certa para um projeto t&#227;o ambicioso e multifacetado.</p>

<p>Estamos ansiosos para ajud&#225;-lo a quebrar mais uma barreira e adicionar mais uma linguagem ao seu repert&#243;rio.
Ao longo deste Equin&#243;cio,
voc&#234; ver&#225; artigos com dicas da linguagem e de alguns dos diversos m&#243;dulos para entrar de cabe&#231;a no hacking de dados p&#250;blicos.</p>

<p>Fa&#231;a valer sua voz na democracia.
Venha fazer parte da comunidade OpenData-BR!</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="Autor"
>Autor</a></h1>

<p>Breno G.
de Oliveira &#60;garu@cpan.org&#62;</p>

</body></html>
